Revit 2027 API
DatumPlane.IsLeaderValid Method
 Identifies if the leader valid or not for this DatumPlane. This method does not apply to Reference planes (which do not support leaders).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLeaderValid(
	DatumEnds datumEnd,
	View view,
	Leader leader
)
Public Function IsLeaderValid (
	datumEnd As DatumEnds,
	view As View,
	leader As Leader
) As Boolean
public:
bool IsLeaderValid(
	DatumEnds datumEnd,
	View^ view,
	Leader^ leader
)
member IsLeaderValid :
        datumEnd : DatumEnds *
        view : View *
        leader : Leader -> bool
Parameters
datumEnd DatumEnds
 The end of the datum plane.
view View
 The view on which the DatumPlane shows.
leader Leader
 The Leader for setting the datum plane.
Return Value
Boolean
 True if the leader is valid for set leader, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This datum plane has no leaders. -or- The DatumPlane should not have a leader.
Remarks
 If the view or leader is null, it will throw ArgumentNullException; A valid leader meets the following conditions:
The leader's End, Elbow and Anchor should lie in the View's plane
The End of the leader should be on the datum plane's curve(s)
The Elbow of the leader should be between the End and Anchor
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace